/* ************************************************************************ *\

 著作権 (C) 2009 Atmel Corporation. 全権利予約済み。

 変更の有りまたはなしでｿｰｽと2進の形式での使用と再配布は以下の条件に合っていれ
 ば許されます。

 1. ｿｰｽ ｺｰﾄﾞの再配布は上の著作権通知、この条件一覧、それと以下のお断りを維持し
	なければなりません。

 2. 2進形式での再配布はこの配布で提供された資料や他の素材で、上の著作権通知、
	この条件一覧、それと以下のお断りを再現しなければなりません。

 3. ATMELの名称は先に書かれた許諾の指定なしにこのｿﾌﾄｳｪｱから派生した販促製品や
	裏書(保証)に使用できないかもしれません。

 4. このｿﾌﾄｳｪｱはATMEL AVR製品との繋がりでだけ再配布そして使用されるかもしれま
	せん。

 このｿﾌﾄｳｪｱはどんな明示的または暗示的な保証、包含物の制限なしの"現状そのまま"
 でATMELによって提供され、特定目的のための市場性と適合性の暗黙的な保証は明白
 且つ明確に放棄されます。たとえATMELがそのような損害賠償の可能性を進言された
 としても、本資料を使用できない、または使用以外で発生する(情報の損失、事業中
 断、または利益の損失に関する制限なしの損害賠償を含み)、直接、間接、必然、偶
 然、特別、または付随して起こる如何なる損害賠償に対しても決してATMELに責任が
 ないでしょう。

\* ************************************************************************ */
