#ifndef __ANALOG_SW__
#define __ANALOG_SW__
// ATtiny13A 1.2MHz 工場出荷時

//      0[v]------+--------+---------+---------+---------+---------+---------+---------+
//                |        |         |         |         |         |         |         |
//               SW16     SW15      SW14      SW13      SW12      SW11      SW10      SW9
//                |        |         |         |         |         |         |         |
//                +--R12K--+--R7.5K--+--R4.7K--+--R3.3K--+--R2.4K--+--R1.8K--+--R1.5K--+
//                                                                                     |
//      0[v]---+--------+--------+--------+--------+--------+--------+-------+         |
//             |        |        |        |        |        |        |       |         |
//            SW1      SW2      SW3      SW4      SW5      SW6      SW7     SW8        |
//             |        |        |        |        |        |        |       |         |
//   +--R6.8K--+--R330--+--R470--+--R510--+--R680--+--R750--+--R820--+--R1K--+--R1.2K--+
//   |         |
//   |  +------+                                  5[V]
//   |  |                                         |
//   +--|-----------------------------------------+
//      |                                         |
//      |                                         |
//      |                          _____          |
//      |               〜RESET---|.    |---VCC---+
//   +--|---R330--＜LED|----PB3---|tiny |---PB2(SCK)----|LED＞----R330----+
//   |  +-------------------PB4---| 13A |---PB1(MIS0)---|LED＞----R330----+
//   +----------------------GND---|_____|---PB0(MOSI)---|LED＞----R330----+
//   |                                                                    |
//   |                                                                    |
//   0[V]                                                                 0[V]
//

// 説明： アナログADC入力(ADC2:PB4)１本の入力値で、１６個のスイッチを判別して、LEDに出力

// ADC2:PB4（値  6未満）：SW番号0x00：SW1 ：LED(０００１)
// ADC2:PB4（値 20未満）：SW番号0x01：SW2 ：LED(００１０)
// ADC2:PB4（値 35未満）：SW番号0x02：SW3 ：LED(００１１)
// ADC2:PB4（値 50未満）：SW番号0x03：SW4 ：LED(０１００)
// ADC2:PB4（値 66未満）：SW番号0x04：SW5 ：LED(０１０１)
// ADC2:PB4（値 81未満）：SW番号0x05：SW6 ：LED(０１１０)
// ADC2:PB4（値 95未満）：SW番号0x06：SW7 ：LED(０１１１)
// ADC2:PB4（値110未満）：SW番号0x07：SW8 ：LED(１０００)
// ADC2:PB4（値125未満）：SW番号0x08：SW9 ：LED(１００１)
// ADC2:PB4（値139未満）：SW番号0x09：SW10：LED(１０１０)
// ADC2:PB4（値153未満）：SW番号0x0a：SW11：LED(１０１１)
// ADC2:PB4（値168未満）：SW番号0x0b：SW12：LED(１１００)
// ADC2:PB4（値182未満）：SW番号0x0c：SW13：LED(１１０１)
// ADC2:PB4（値193未満）：SW番号0x0d：SW14：LED(１１１０)
// ADC2:PB4（値211未満）：SW番号0x0e：SW15：LED(１１１１)
// ADC2:PB4（値231未満）：SW番号0x0f：SW16：LED(００００)<->LED(１１１１)：：blink
// ADC2:PB4（値231以上）：SW番号0xff：    ：LED(００００)



#include <avr/io.h>

void asw_ini( void );
void asw_main( void );
void asw( void );





#endif
